{"books":[{"id":1,"name":"blueblock tập 1","image":"blueblock-1.jpg","album":["images/blueblock-1.jpg","images/blueblock-2.jpg","images/blueblock-3.jpg","images/blueblock-4.jpg"],"price":50000,"promotion":45000,"description":" MANG TRONG MÌNH ƯỚC MƠ TRỞ THÀNH SỐ 1 THẾ GIỚI, 300 TIỀN ĐẠO – 300 CÁI TÔI ĐÃ TẬP HỢP LẠI!! Tại World Cup 2018, Nhật Bản phải dừng bước ở vòng 16 đội… Đáp lại điều này, Liên đoàn Bóng đá Nhật Bản đã thiết lập một cơ sở đào tạo mang tên BLUELOCK, nơi tập hợp 300 tiền đạo đang là học sinh trung học, nhằm hướng tới mục tiêu vô địch World Cup. Người đảm nhiệm vị trí huấn luyện viên, Ego Jinpachi khẳng định rằng, yếu tố cần thiết cho nền bóng đá Nhật Bản chính là “một tiền đạo có cái tôi cao nhất”. Và những tiền đạo vô danh như Isagi Yoichi sẽ thử sức trong một khóa huấn luyện sống còn, biến bản thân trở thành những kẻ mang cái tôi to lớn ấy! ĐỂ MỘT LẦN NỮA HIỆN THỰC HÓA GIẤC MỘNG ĐĂNG QUANG WORLD CUP, NỀN BÓNG ĐÁ NHẬT BẢN PHẢI BỊ KHAI TỬ!!","publishingCompany":"NXB Kim Đồng","author":"Muneyuki Kaneshiro","series":"blueblock","painter":"Yusuke Nomura","origin":"Việt Nam","quantity":47,"quantityBuy":1,"translator":"Yoda","format":"Bìa Rời","numberOfPage":208,"ISBN":9786042285346,"size":"11,3 x 17,6cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"150g","releaseDate":"20/02/2023","tags":"thể thao","available":true},{"id":2,"name":"tokyo 卍 revenger tập 9","image":"tokyo-revenger-9.jpg","album":[],"price":115000,"promotion":0,"description":"Đáp ứng lời thỉnh cầu của Inui, Takemichi trở thành thủ lĩnh Black Dragon đời thứ 11. Trận chiến toàn diện giữa Toman và Tenjiku ngày một gần, âm mưu hung hiểm của Kisaki cũng dần lộ rõ…!? Mời các bạn thưởng thức Tokyo 卍 Revengers tập 9, phiên bản 2 trong 1 của Việt Nam (tương đương tập 17 và 18 bản Nhật)","publishingCompany":"IPM","author":"Ken Wakui","series":"Tokyo Revenger","painter":"Ken Wakui","origin":"Việt Nam","quantity":47,"quantityBuy":1,"translator":"Miro","format":"Bìa Rời","numberOfPage":386,"ISBN":9786043822311,"size":"13 x 18cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"400g","releaseDate":"9/02/2023","tags":"học đường","available":false},{"id":3,"name":"86-eighty six tập 7","image":"eighty-six-7.jpg","album":[],"price":125000,"promotion":0,"description":" Lữ đoàn Biệt kích Cơ động 86 đã bắt giữ thành công Nữ hoàng tàn nhẫn, một trong các chỉ huy cấp cao của Legion, “viên đạn bạc” quý báu giúp con người lật ngược thế cờ trong cuộc chiến với lũ máy móc giết chóc. Việc phân tích, “tra khảo” Nữ hoàng tàn nhẫn được Liên bang và Vương quốc Liên hiệp tiến hành tại nước đồng minh đóng vai trò bên thứ ba - Đồng minh Hiệp ước Wald.Nhóm Shin, Lena được thưởng một kì nghỉ đặc biệt sau chiến công lớn nêu trên.Khoảng thời gian xả hơi giúp họ tạm quên đi chiến trường sặc mùi sắt thép và máu tanh.Có điều trong lúc đó, hầu như tất cả mọi người trừ hai nhân vật chính đều thầm nghĩ…“Hai người mau mau thành đôi đi!” Một “cuộc chiến” mới(!?) đang chờ đợi hai cô cậu tuổi thiếu niên!","publishingCompany":"IPM","author":"Asato Asato","series":"Eighty Six","painter":" Shirabii Thiết kế vũ khí: I-IV","origin":"Việt Nam","quantity":0,"quantityBuy":0,"translator":"Ngân Linh","format":"Bìa Rời","numberOfPage":292,"ISBN":9786043808643,"size":"13 x 18cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"250g","releaseDate":"11/02/2023","tags":"hành động","available":true},{"id":4,"name":"ký sinh trùng biết yêu","image":"ky-sinh-trung-biet-yeu.jpg","album":[],"price":120000,"promotion":105600,"description":" “Anh Kosaka này, anh đã bao giờ nghĩ thế này chưa? Rằng mình sẽ chết đi trong khi chưa đem lòng yêu ai. Rằng sẽ chẳng ai khóc thương khi mình ra đi cả.”Chàng trai thất nghiệp Kosaka Kengo và cô nữ sinh bỏ học Sanagi Hijiri đã phải lòng nhau trong quá trình cùng điều trị phục hồi chức năng nhằm tái hòa nhập cộng đồng.Song những ngày hạnh phúc không kéo dài. Họ không hề hay biết, tình yêu của họ chẳng qua là do “trùng” điều khiển…","publishingCompany":"IPM","author":"Miaki Sugaru","series":"Oneshot Novel","painter":"Shion","origin":"Việt Nam","quantity":49,"quantityBuy":1,"translator":"Phương Anh","format":"Bìa Rời","numberOfPage":318,"ISBN":9786043809152,"size":"13 x 18cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"300g","releaseDate":"16/02/2023","tags":"ngôn tình","available":false},{"id":5,"name":"black jack tập 17","image":"black-jack-17.jpg","album":[],"price":30000,"promotion":0,"description":" Câu chuyện xoay quanh việc chữa bệnh cứu người và những vấn đề y khoa, trong đó nhân vật chính là Black Jack, một bác sĩ tài giỏi nhưng “quái dị”. Điểm đặc biệt của anh chính là một vết sẹo dài trên khuôn mặt mà bất cứ ai trông thấy cũng phải khiếp sợ. Những người bệnh tìm đến anh đa số là những người, hoặc người thân họ, mắc những căn bệnh lạ hay bệnh hiểm nghèo mà không có vị bác sĩ nào có thể chữa được. Họ tìm đến anh với hy vọng anh dùng tài phẫu thuật kỳ diệu của mình để giữ lại mạng sống cho họ. Mỗi tập truyện là những câu chuyện xoay quanh việc chữa trị bệnh có một không hai của bác sĩ quái dị Black Jack. Qua đó, bạn đọc được chứng kiến công việc cực nhọc, những cuộc phẫu thuật đẫm mồ hôi và cả những lúc đứng trước quyết định sinh tử của một bác sĩ. Chính nhờ đó, câu chuyện của bác sĩ Black Jack đã truyền cảm hứng cho nhiều bạn đọc truyền tranh trong việc theo đuổi đam mê nghề y của mình.Bộ truyện phù hợp với lứa tuổi cấp 2 trở lên; đặc biệt cho những ai đã từng yêu Bác sĩ quái dị của những năm 90 có cơ hội đọc lại và sưu tầm bản bìa cứng.","publishingCompany":"NXB Trẻ","author":"Osamu Tezuka","series":"Black Jack","painter":"Osamu Tezuka","origin":"Việt Nam","quantity":0,"quantityBuy":0,"translator":"Nghi Nguyễn","format":"Bìa Rời","numberOfPage":228,"ISBN":9786041215689,"size":"11,3 x 17,6cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"170g","releaseDate":"24/02/2023","tags":"trí tuệ","available":true},{"id":6,"name":"chú thuật hồi chiến tập 10: lễ hội đêm","image":"jujutsu-kaisen-10.jpg","album":[],"price":30000,"promotion":0,"description":"Để có được cơ thể hoàn chỉnh, Muta Kokichi, cũng chính là “Mechamaru”, đã cấu kết với phe chú linh... Song đàm phán thất bại, buộc cậu phải đối đầu Mahito. Liệu Muta có thoát khỏi cửa tử bằng kế sách bí mật...!? Và vào ngày 31 tháng 10, màn được hạ xuống phố, “biến cố Shibuya” chính thức bắt đầu!!","publishingCompany":"IPM","author":"NXB KIM ĐỒNG","series":"Tokyo Revenger","painter":"Ken Wakui","origin":"Việt Nam","quantity":0,"quantityBuy":0,"translator":"Miro","format":"Bìa Rời","numberOfPage":386,"ISBN":9786043822311,"size":"13 x 18cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"400g","releaseDate":"9/02/2023","tags":"học đường","available":true},{"id":7,"name":"người lạ dưới gió xuân tập 1","image":"nguoi-la-duoi-gio-xuan-1.jpg","album":[],"price":103000,"promotion":0,"description":"Rời khỏi hòn đảo nhỏ xa xôi thuộc tỉnh Okinawa, tiểu thuyết gia Shun trở lại quê nhà ở Hokkaido, dẫn theo Mio, người yêu kém tuổi mà anh quen trên đảo. Kể từ ngày tuyên bố mình là *** rồi chạy trốn khỏi hôn lễ với cô bạn thuở ấu thơ, Shun đã hoàn toàn đoạn tuyệt với gia đình. Nhưng khi nghe tin cha bị bệnh, anh quyết định phải trở về nhà một chuyến. Cùng cậu bạn trai sống dưới mái nhà nơi mình đã từng gây ra bao điều rắc rối, đối với Shun, đây quả là cuộc đoàn tụ vô cùng khó xử, nhưng với Mio, người đã mất cả cha lẫn mẹ … Diễn biến câu chuyện sẽ ra sao, mời các bạn đón đọc tập 1 của phần 2 bộ truyện Người lạ bên bờ biển nhé!","publishingCompany":"Amak Books","author":"Kii Kanna","series":"Người Lạ Dưới Gió Xuân","painter":"Kii Kanna","origin":"Việt Nam","quantity":50,"quantityBuy":0,"translator":"Hoàng Anh","format":"Bìa Rời","numberOfPage":188,"ISBN":9786043826746,"size":"13 x 18cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"200g","releaseDate":"15/02/2023","tags":"tình cảm","available":true},{"id":8,"name":"komi - nữ thần sợ giao tiếp tập 18","image":"komi-nu-than-so-giao-tiep-18.jpg","album":[],"price":120000,"promotion":105600,"description":"Khép lại lễ hội văn hóa, Komi và những người bạn quay về với nhịp sống thường nhật. Chuỗi ngày bình thường nhưng lại mang những sắc màu kì lạ. Nào là câu chuyện ban nhạc của Nakanaka được thành lập vào lễ hội văn hóa, chơi giải đố thoát ngục ở nhà Otori, hay Komi và Tadano bị kẹt trong kho nhà thể chất! Bạn bè, cha mẹ, con cái, những muộn phiền yêu đương, tất cả cứ từng bước tiến về phía trước. Phức tạp nhưng lại ấm áp, khó khăn mà vẫn thú vị. Những câu chuyện giao tiếp tiếp tục chuyển mình cùng bốn mùa. Đừng bỏ lỡ tập 18 câu chuyện hài hước về người đẹp kém giao tiếp muốn làm rung động gì đó với tâm tư “muốn truyền đạt” của bản thân!!","publishingCompany":"NXB KIM ĐỒNG","author":"Tomohito Oda","series":"Komi - Nữ Thần Sợ Giao Tiếp","painter":"Tomohito Oda","origin":"Việt Nam","quantity":50,"quantityBuy":0,"translator":"Real","format":"Bìa Rời","numberOfPage":192,"ISBN":9786042283991,"size":"11,3 x 17,6cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"150g","releaseDate":"20/02/2023","tags":"tình cảm","available":true},{"id":9,"name":"666 satan tập 9","image":"666-satan-9.jpg","album":[],"price":30000,"promotion":0,"description":"Vòng chung kết Olympia – giải đấu O.P.T. cuối cùng cũng bắt đầu!! 10 chiến binh vượt qua vòng sơ tuyển sẽ dốc toàn lực chiến đấu để giành lấy vinh quang và O-Parts tối thượng!!!","publishingCompany":"NXB KIM ĐỒNG","author":"Seishi Kishimoto","series":"666 Satan","painter":"Seishi Kishimoto","origin":"Việt Nam","quantity":50,"quantityBuy":0,"translator":"Yoda","format":"Bìa Rời","numberOfPage":188,"ISBN":9786042286213,"size":"11,3 x 17,6cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"130g","releaseDate":"24/02/2023","tags":"thể thao","available":true},{"id":10,"name":"pokémon the movies: câu chuyện của chúng ta - ngoại truyện về zeraoza","image":"pokemon-the-movies-cau-chuyen-cua-chung-ta.jpg","album":[],"price":25000,"promotion":0,"description":" Tại thành phố Fuura, Satoshi, Pikachu cùng cô bạn Rarugo đã được chiêm ngưỡng sự ra đời cũng như quá khứ hào hùng của Pokémon Huyền ảo Zeraora, nhờ những phát minh từ một vị giáo sư kì lạ. Trên tay các bạn chính là ngoại truyện về Zeraora, lấy cảm hứng từ Movie “POKÉMON: CÂU CHUYỆN CỦA CHÚNG TA!” từng làm mưa làm gió khắp các rạp chiếu. Cùng đón đọc nhé!","publishingCompany":"NXB KIM ĐỒNG","author":" Satoshi Tajiri, Eiji Umehara, Aya Takaba, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto","series":"Pokémon The Movie, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto","painter":"Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto","origin":"Việt Nam","quantity":50,"quantityBuy":0,"translator":"Thế Đôn, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto","format":"Bìa Rời","numberOfPage":188,"ISBN":9786042277488,"size":"11,3 x 17,6cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"90g","releaseDate":"06/02/2023","tags":"phiêu lưu","available":true},{"id":11,"name":"ma vương của tôi đây nên yêu cô dâu elf của mình như thế nào tập 1","image":"ma-vuong-cua-toi-day-nen-yeu-co-dau-elf-cua-minh-nhu-the-nao-1.png","album":[],"price":140000,"promotion":120000,"description":"Zagan nổi tiếng là một ma thuật sư đáng sợ, lầm lì và độc miệng. Ngày ngày anh chỉ vùi đầu vào nghiên cứu ma thuật và đánh bay mấy tên trộm lẻn vào lãnh địa của mình.Mọi chuyện bắt đầu… vào buổi sáng hôm ấy. Tại buổi đấu giá ngầm ấy, Zagan đã bắt gặp một cô gái Elf sở hữu mái tóc trắng và vẻ đẹp tuyệt thế tên là Nephi. Ngay khoảnh khắc đó, Zagan đã yêu cô từ cái nhìn đầu tiên và vét sạch gia tài của mình để chuộc cô về, song một kẻ ăn nói vụng về như anh lại chẳng biết nên đối đãi với cô như thế nào. Phải làm sao để bắt chuyện với cô gái mình thích đây…! “Bầu trời đẹp nhỉ? \" …Không. Không được. Câu này không ổn. “Cô thấy tòa lâu đài này thế nào?”...Không, không được. Câu này cũng không ổn. Cứ như thế, đã gần ba mươi phút trôi qua mà Zagan vẫn chưa thể mở lời với cô gái mà mình thích. Mình, một Ma vương, đã biến một nàng nô lệ Elf thành cô dâu của mình, nhưng mình nên yêu cô ấy như thế nào mới tốt đây?","publishingCompany":"Sky Books","author":"Fuminori Teshima","series":"Ma Vương Tôi Đây Nên Yêu Cô Dâu Elf Của Mình Như Thế Nào?","painter":"Comta","origin":"Việt Nam","quantity":50,"quantityBuy":0,"translator":"Trần Thiện Anh","format":"Bìa Gập","numberOfPage":320,"ISBN":9786043901993,"size":"13 x 18cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"350g","releaseDate":"08/03/20233","tags":"tình cảm","available":true},{"id":12,"name":"holmes ở tokyo tập 8","image":"holmes-o-tokyo-8.jpg","album":[],"price":85000,"promotion":70000,"description":"Aoi đã tốt nghiệp cấp ba, thuận lợi thi đỗ vào Đại học Phủ Kyoto đúng như nguyện vọng. Kiyotaka cũng hoàn thành chương trình cao học, ngỡ rằng quan hệ của hai người cuối cùng cũng đến lúc sang trang… thế mà Kiyotaka lại phải nghe lệnh ông chủ, đi thực tập ở bên ngoài Kyoto để được va vấp xã hội! Nơi thực tập đầu tiên là Bảo tàng nghệ thuật Shokado. Vào ngày nghỉ, Aoi cùng cô bạn cùng khoá Kaori bí mật tới xem tình hình Kiyotaka, nhưng một vụ án không ngờ đang đợi ba người ở đó…!?","publishingCompany":"Wings Books","author":"Mai Mochizuki","series":"Holmes Ở Kyoto","painter":" N/A","origin":"Việt Nam","quantity":50,"quantityBuy":0,"translator":"Ninh Nhân Văn","format":"Bìa Rời","numberOfPage":348,"ISBN":9786042283236,"size":"13 x 19cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"315g","releaseDate":"24/03/2023","tags":"tình cảm","available":true},{"id":13,"name":"swort art online tập 24","image":"swort-art-online-24.jpg","album":[],"price":125000,"promotion":110000,"description":"Tập 24 là sự xen kẽ các phân cảnh của ba thế giới: hiện thực, Unital Ring và Underworld. Ở hiện thực, Kirito đang băn khoăn tìm quà tặng sinh nhật tuổi 19 cho cô bạn gái xinh đẹp giỏi giang. Trước đó, cậu phải đến tiệm bánh ngọt đắt tiền ở Ginza để gặp một nhân vật khả nghi. Argo đòi bám càng. Ở Unital Ring, Kirito lo lắng về cuộc tấn công nhà gỗ lần thứ ba của kẻ địch với quy mô và ác ý ghê gớm hơn hẳn hai lần đầu. Trước đó, cậu phải đến điểm xuất phát của các game thủ để đón một cô bạn vừa convert vào. Alice đòi bám càng. Ở Underworld, Kirito chộn rộn trước sự xuất hiện của trưởng đoàn cơ sĩ, một người từ mắt đến môi đều gợi nhớ người bạn thân đã khuất. Trước đó cậu phải đi dò đường điều tra xem kẻ ngoài cuộc nào đã đột nhập vào đây. Lần này đồng hành với cậu là Asuna và Alice. Các thế giới luân phiên liên tục vận động trong tập 24 khiến tâm trạng tình trạng các nhân vật luôn bối rối tất bật và cũng như tập 23, câu chuyện lại tạm dừng ở chỗ vô cùng gay cấn, khi một boss tầng đầy dấu ấn của SAO bỗng dưng xuất hiện trong Unital Ring.","publishingCompany":"IPM","author":"Reki Kawahara","series":"Sword Art Online","painter":"Abec","origin":"Việt Nam","quantity":0,"quantityBuy":0,"translator":"Mỹ Trinh","format":"Bìa Rời","numberOfPage":348,"ISBN":9786043954029,"size":"13 x 18cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"350g","releaseDate":"17/03/2023","tags":"Thể Thao","available":true},{"id":14,"name":"tiểu thuyết thanh gươm diệt quỷ-người dẫn lối của gió","image":"tieu-thuyet-thanh-guom-diet-quy-nguoi-dan-loi-cua-gio.jpg","album":[],"price":55000,"promotion":44000,"description":" Nhờ cuộc gặp gỡ vào thời niên thiếu với Kumeno Masachika - một kiếm sĩ sử dụng Hơi thở của gió, Sanemi đã biết đến và gia nhập đội Diệt quỷ. Tuy tính khí hoàn toàn trái ngược, lúc nào cũng cự nự nhau nhưng họ vẫn chung chí hướng nỗ lực rèn luyện để hướng đến vị trí “Trụ cột”. Masachika vừa là tiền bối, vừa là “đối thủ”, đồng thời cũng là người đầu tiên nhìn ra khía cạnh đặc biệt ẩn sâu dưới vẻ ngoài gai góc của Sanemi. Mọi chuyện tưởng chừng suôn sẻ, cho đến một ngày họ nhận được mệnh lệnh phối hợp thực hiện nhiệm vụ… Chuyện chưa từng được kể về Phong trụ Shinazugawa Sanemi và nhiều nhân vật thú vị khác như Hashibira Inosuke, Hà trụ Tokito Muichiro… sẽ được hé mở trong tuyển tập 5 câu chuyện với đủ sắc thái cảm xúc!! Ngoài ra, “Học viện Diệt quỷ” cũng tái xuất với những mẩu chuyện vui nhộn của cấp hai và cấp ba!","publishingCompany":"NXB KIM ĐỒNG","author":"Aya Yajima","series":"Tiểu Thuyết Thanh Gươm Diệt Quỷ","painter":"Koyoharu Gotouge","origin":"Việt Nam","quantity":50,"quantityBuy":0,"translator":"Itsuwa Rei","format":"Bìa Rời","numberOfPage":236,"ISBN":9786042280037,"size":"13 x 19cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"236g","releaseDate":"30/01/2023","tags":"hành động","available":true},{"id":15,"name":"lớp học đề cao thực lực tập 4","image":"lop-hoc-de-cao-thuc-luc-4.jpg","album":[],"price":120000,"promotion":105.6,"description":"Thử thách sinh tồn trên hoang đảo kết thúc êm đẹp, khép lại nửa đầu của kì kiểm tra đặc biệt trong dịp nghỉ hè. Học sinh khối Mười bước vào cuộc chiến theo đội trên “sàn đấu” là du thuyền hạng sang. Đề bài khác hẳn so với thử thách sinh tồn, mở ra một cuộc đấu trí nhằm thử thách năng lực tư duy. Học sinh các lớp từ A đến D được chia thành 12 đội phỏng theo 12 con giáp, với nhiệm vụ tìm ra thành viên đặc biệt duy nhất của đội. Trong khi đa số học sinh bất ngờ vì bài kiểm tra phá vỡ lối suy nghĩ “các lớp đối đầu nhau”, nhân tài của mỗi lớp như Katsuragi và Ryuen đã nhìn ra mục tiêu và bắt đầu hành động. Còn Kiyotaka lại chú ý tới sự bất thường nơi Karuizawa Kei - cô bạn cùng lớp chung đội, để rồi dấn thân vào một cuộc chiến khác nhằm giải phóng cô khỏi “quá khứ không cách nào rũ bỏ”.","publishingCompany":"IPM","author":"Kinugasa Syougo","series":"Lớp Học Đề Cao Thực Lực","painter":" Tomoseshunsaku","origin":"Việt Nam","quantity":50,"quantityBuy":0,"translator":"Thu Hằng","format":"Bìa Rời","numberOfPage":365,"ISBN":9786043823516,"size":"13 x 18cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"330g","releaseDate":"12/10/2022","tags":"học đường","available":true},{"id":16,"name":"thiên sứ nhà bên tập 4","image":"thien-su-nha-ben-4.jpg","album":[],"price":95000,"promotion":83000,"description":" “Đối với tôi... cậu ấy là người quan trọng nhất.”\nTrong khi cả lớp náo loạn vì phát ngôn gây sốc ấy của Mahiru thì Amane - người không thể đoán định được suy nghĩ của cô - đã quyết tâm trở thành chàng trai xứng đáng ở bên cạnh cô ấy.\nĐể theo kịp Mahiru, cô gái xinh đẹp, thông minh, hoàn hảo và luôn dành sự tin tưởng cho cậu, Amane đang rất phấn đấu trong cả chuyện học hành lẫn rèn luyện thể thao. Chẳng rõ Mahiru có hiểu cho tâm ý của Amane hay không, nhưng chính Mahiru cũng đang cố gắng tiến thêm một bước để xoay chuyển trạng thái mơ hồ trong mối quan hệ của hai người.","publishingCompany":"Wings Books","author":" Saekisan","series":" Thiên Sứ Nhà Bên","painter":" Hanekoto","origin":"Việt Nam","quantity":50,"quantityBuy":0,"translator":"Trân Trân","format":"Bìa Rời","numberOfPage":340,"ISBN":9786042273411,"size":"13 x 19cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"310g","releaseDate":"30/09/2022","tags":"tình cảm","available":true},{"id":17,"name":"subaru và vì tinh tú thứ 7 tập 1","image":"subaru-va-vi-tinh-tu-thu-7-1.jpg","album":[],"price":98000,"promotion":0,"description":"Tại thế giới game nổi tiếng “Union”, có một nhóm người chơi đã trở thành huyền thoại. Tên của họ là Subaru. Họ là nhóm học sinh tiểu học đã thân thiết với nhau từ bé, cùng với Sense của mỗi người, họ đã chạm đến đỉnh cao nhất của game. Thế nhưng, sự kiện chết người đó đã khiến “Union” chấm dứt hoạt động. Nhóm bạn thân thiết cũng chia xa. 6 năm sau, Haruto giờ đã là học sinh trung học phổ thông. Cậu lần nữa đăng nhập vào thế giới game mới là “ReUnion”, rồi có cuộc hội ngộ với thiếu nữ nọ. Cô ấy là Asahi – đồng đội của cậu khi còn ở Subaru, là bạn thanh mai trúc mã, và cũng là người đã chết sáu năm trước. Liệu Asahi là hồn ma điện tử, hay thứ gì khác…? Giao giữa hiện thực và thế giới trong game, tiểu thuyết thanh xuân đầy đột phá!","publishingCompany":"Amak Books","author":"Noritake Tao","series":"Subaru Và Vì Tinh Tú Thứ 7","painter":"Booota","origin":"Việt Nam","quantity":0,"quantityBuy":0,"translator":"Trần Anh Ly","format":"Bìa Rời","numberOfPage":290,"ISBN":9786043286441,"size":"13 x 18cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"250g","releaseDate":" 30/07/2021","tags":"phiêu lưu","available":true},{"id":18,"name":"gate- lực lượng phồng vệ chiến đấu ở dị dới tập 1","image":"gate-luc-luong-phong-ve-chien-dau-o-di-doi-1.jpg","album":[],"price":170000,"promotion":140000,"description":"Năm 20xx. Giữa một trưa nắng nóng tại khu G, thành phố T, một Cánh cổng dẫn đến thế giới khác đột nhiên xuất hiện.\n \nTừ trong Cánh cổng tràn ra một đội quân quái vật từ thế giới bên kia, ra tay thảm sát biến khu vực G thành địa ngục trong nháy mắt. Bằng vũ khí và chiến thuật áp đảo, Lực lượng phòng vệ nước J đã đánh bại đối phương và thành lập căn cứ quân sự bên kia Cánh cổng, chống lại sự xâm lăng của Đế quốc cùng tìm kiếm cơ hội đàm phán hòa bình.\n\nTrung úy Itami Youji, một otaku của Lực Lượng phòng vệ, chỉ huy đội trinh sát số 3, được lệnh đi điều tra về thế giới bên kia, nơi được gọi là Khu vực đặc biệt. Đó là một thế giới đầy kỳ diệu, ở đó anh đã phải chiến đấu với rồng, gặp gỡ những cô gái xinh đẹp là pháp sư, tinh linh và cả á thần vốn chỉ tồn tại trong truyền thuyết.\n\nCùng lúc ấy, ở bên ngoài Cánh cổng, các quốc gia khác bắt đầu gây áp lực ngoại giao lên nước J, thể hiện tham vọng muốn chiếm đoạt nguồn tài nguyên dồi dào của Khu vực đặc biệt.\n\nHai thế giới, với những người có tư tưởng khác nhau, thậm chí đối lập, được kết nối thông qua Cánh cổng, hòa quyện với nhau thành một cuộc phiêu lưu kỳ thú.","publishingCompany":"Amak Books","author":"Takumi Yanai","series":"GATE - Lực Lượng Phòng Vệ Chiến Đấu Ở Dị Giới","painter":"N/A","origin":"Việt Nam","quantity":50,"quantityBuy":0,"translator":"Công Hữu","format":"Bìa Rời","numberOfPage":510,"ISBN":9786045550014,"size":"14,5 x 20,5cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"620g","releaseDate":"10/05/2021","tags":"hành động","available":false},{"id":19,"name":"tanya chiến ký tập 1","image":"tanya-chien-ky-1.jpg","album":[],"price":145000,"promotion":0,"description":"Tanya chiến ký bắt đầu với khung cảnh một bé gái cất tiếng khóc chào đời tại một cô nhi viện, tuy nhiên, có vẻ như bé gái ấy lại tồn tại một ý thức khác, ý thức ấy thuộc về một trưởng phòng nhân sự mẫn cán tại Nhật Bản xa xôi. Là người phụ trách nhân sự, trong thời buổi kinh tế khó khăn và đổi mới công nghệ, anh ta đã hoàn thành xuất sắc việc cắt giảm nhân sự không hiệu quả cho công ty, dẫu đó có là một nhân viên lâu năm hay dẫu người ấy có quỳ lạy khóc lóc như nào. Sự vô tình này đã khiến anh ta hứng lấy sự uất hận từ người bị sa thải, và trong một khoảnh khắc trước khi ý thức mất đi, anh ta vẫn nhớ rằng mình đang đứng đợi tàu điện ở sát đường ray rồi bị một ai đó đẩy từ phía sau.\n\nMột thực thể bí ẩn X tự xưng là thần xuất hiện, phê phán cách sống thiếu đức tin và lòng trắc ẩn của nhân loại ngày nay như anh ta. Thực thể X kết luận, nếu phải sống trong một thế giới nhiều chiến loạn và hạn chế về cơ thể, hẳn sinh vật vô tâm và vô thần kia cũng sẽ nảy sinh đức tin và gửi những lời cầu nguyện lên thần linh. Khoảnh khắc này cũng đánh dấu sự chào đời của một bé gái có tên Tanya tại một cô nhi viện thuộc Đế Quốc, cường quốc quân sự tại một thế giới khác.\n\nHình ảnh một bé gái dễ thương tóc vàng, mắt xanh bay giữa chiến trường hỗn loạn đau thương và mất mát trở thành một giai thoại, mở đầu cho câu chuyện về hành trình chứng minh giá trị bản thân để leo lên vị trí tốt với nhiều chế độ ưu đãi của cựu trưởng phòng nhân sự giờ đây mang hình hài một bé gái ở một thế giới khác có tên gọi Tanya Degurechaff!","publishingCompany":"Hikari Light Novel","author":"Carlo Zen","series":"Tanya Chiến Ký","painter":" Shinobu Shinotsuki","origin":"Việt Nam","quantity":50,"quantityBuy":0,"translator":" Dương Gia Thịnh","format":"Bìa Rời","numberOfPage":592,"ISBN":9786045544877,"size":"13 x 19cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"560g","releaseDate":"19/08/2019","tags":"hành động","available":true},{"id":20,"name":"hiệp sỉ lưu ban tập 7","image":"hiep-si-luu-ban-7.jpg","album":[],"price":98000,"promotion":0,"description":"  “Nếu chị thắng, em phải trở thành người mẫu cho chị nhé”\n\nVì lịch trình thi đấu thay đổi nên Ikki phải thi đấu hai trận liên tiếp và giành chiến thắng trong trận chiến đầu tiên nhờ Nhất Đao Tu La. Tuy nhiên cậu không thể sử dụng át chủ bài này trong trận đấu kế tiếp.\nTrận giao chiến độc nhất vô nhị giữa họa sĩ và hiệp sĩ!\n Hiệp sĩ lưu ban 7 – Tập của những trận chiến kịch tính, liễu lĩnh xin phép được ra mắt!","publishingCompany":"Amak Books","author":"Riku Misora","series":"Hiệp Sĩ Lưu Ban","painter":"Won","origin":"Nhã An","quantity":50,"quantityBuy":0,"translator":"Thế Đôn, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto, Kemon Kawamoto","format":"Bìa Gập","numberOfPage":300,"ISBN":9786048325015,"size":"13 x 18cm","picture":"Trắng/Đen","language":"Tiếng Việt","weight":"250g","releaseDate":"15/08/2019","tags":"hành động","available":true}],"orders":[{"id":1,"bookId":16,"customerName":"ThanhDat","fullName":"Nguyễn Thành Đạt","gender":"Nam","phone":"123456","address":"12 trinh dinh thao","country":"Việt Nam","city":"Hồ Chí Minh","district":"Tân Phú","taxCode":"7000","quantity":1,"timestamp":1679670839771},{"id":2,"bookId":16,"customerName":"ThanhDat","fullName":"Nguyễn Thành Đạt","gender":"Nam","phone":"123456","address":"12 trinh dinh thao","country":"Việt Nam","city":"Hồ Chí Minh","district":"Tân Phú","taxCode":"7000","quantity":1,"timestamp":1679671003520},{"id":3,"bookId":11,"customerName":"{{username}}","fullName":"{{fullName}}","gender":"{{gender}}","phone":"{{phone}}","address":"{{address}}","country":"{{country}}","city":"{{city}}","district":"{{district}}","taxCode":"","quantity":1,"timestamp":1680491344434}],"users":[{"id":1,"email":"admin@gmail.com","password":"admin123","username":"admin","company":"","tax-code":"","address-company":"","gender":"","full-name":"","birthday":"","phone":"","address":"","country":"","city":"","district":""},{"id":2,"username":"ThanhDat","email":"thanhdat1@gmail.com","password":"Thanhdat1","company":"clone","taxCode":"7000","addressCompany":"tân phú","gender":"Nam","fullName":"Nguyễn Thành Đạt","birthday":"7/11/2003","phone":"123456","address":"12 trinh dinh thao","country":"Việt Nam","city":"Hồ Chí Minh","district":"Tân Phú"},{"id":3,"username":"thanhdat2","email":"thanhdat2@gmail.com","password":"thanhdat2"}]}